# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [34]:
first = pd.Series(np.random.randint(1, 5, size=100))
second = pd.Series(np.random.randint(1, 4, size=100))
third = pd.Series(np.random.randint(10000, 30001, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [35]:
df = pd.DataFrame(data={"first": first, "second": second, "third": third})
df.head()

   first  second  third
0      4       1  12595
1      4       1  19855
2      3       1  14794
3      3       1  28224
4      4       3  26309

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [36]:
df.rename(columns={"first": "bedrs", "second": "bathrs", "third": "price_sqr_meter"}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       4       1            12595
1       4       1            19855
2       3       1            14794
3       3       1            28224
4       4       3            26309
..    ...     ...              ...
95      4       2            28305
96      4       2            25113
97      3       3            14577
98      1       2            12832
99      2       3            20186

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [44]:
df4 = pd.concat([first, second, third]).to_frame()

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [45]:
df4.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [57]:
df4.set_index(np.arange(0, 300))

         0
0        4
1        4
2        3
3        3
4        4
..     ...
295  28305
296  25113
297  14577
298  12832
299  20186

[300 rows x 1 columns]